microhal/microhal/microhal/ports/stmCommon/registers/peripheralBaseAddressDefinitions/registersBaseAddressDefinitions_stm32f410.h
#ifndef _MICROHAL_REGISTERS_BASE_ADDRESS_DEFINITIONS_STM32F410_H_
#define _MICROHAL_REGISTERS_BASE_ADDRESS_DEFINITIONS_STM32F410_H_

#define _MICROHAL_ADC_COMMON_BASE_ADDRESS 0x40012300
#define _MICROHAL_ADC1_BASE_ADDRESS 0x40012000
#define _MICROHAL_CRC_BASE_ADDRESS 0x40023000
#define _MICROHAL_DBG_BASE_ADDRESS 0xE0042000
#define _MICROHAL_EXTI_BASE_ADDRESS 0x40013C00
#define _MICROHAL_FLASH_BASE_ADDRESS 0x40023C00
#define _MICROHAL_IWDG_BASE_ADDRESS 0x40003000
#define _MICROHAL_PWR_BASE_ADDRESS 0x40007000
#define _MICROHAL_RCC_BASE_ADDRESS 0x40023800
#define _MICROHAL_RTC_BASE_ADDRESS 0x40002800
#define _MICROHAL_SYSCFG_BASE_ADDRESS 0x40013800
#define _MICROHAL_TIM1_BASE_ADDRESS 0x40010000
#define _MICROHAL_TIM8_BASE_ADDRESS 0x40010400
#define _MICROHAL_TIM11_BASE_ADDRESS 0x40014800
#define _MICROHAL_TIM5_BASE_ADDRESS 0x40000C00
#define _MICROHAL_TIM9_BASE_ADDRESS 0x40014000
#define _MICROHAL_USART1_BASE_ADDRESS 0x40011000
#define _MICROHAL_USART2_BASE_ADDRESS 0x40004400
#define _MICROHAL_USART6_BASE_ADDRESS 0x40011400
#define _MICROHAL_WWDG_BASE_ADDRESS 0x40002C00
#define _MICROHAL_DMA2_BASE_ADDRESS 0x40026400
#define _MICROHAL_DMA1_BASE_ADDRESS 0x40026000
#define _MICROHAL_GPIOH_BASE_ADDRESS 0x40021C00
#define _MICROHAL_GPIOC_BASE_ADDRESS 0x40020800
#define _MICROHAL_GPIOB_BASE_ADDRESS 0x40020400
#define _MICROHAL_GPIOA_BASE_ADDRESS 0x40020000
#define _MICROHAL_I2C2_BASE_ADDRESS 0x40005800
#define _MICROHAL_I2C1_BASE_ADDRESS 0x40005400
#define _MICROHAL_SPI1_BASE_ADDRESS 0x40013000
#define _MICROHAL_SPI2_BASE_ADDRESS 0x40003800
#define _MICROHAL_SPI5_BASE_ADDRESS 0x40015000
#define _MICROHAL_NVIC_BASE_ADDRESS 0xE000E100
#define _MICROHAL_TIM6_BASE_ADDRESS 0x40001000
#define _MICROHAL_RNG_BASE_ADDRESS 0x40080000
#define _MICROHAL_DAC_BASE_ADDRESS 0x40007400
#define _MICROHAL_LPTIM1_BASE_ADDRESS 0x40002400
#define _MICROHAL_I2C4_BASE_ADDRESS 0x40006000
#define _MICROHAL_FPU_BASE_ADDRESS 0xE000EF34
#define _MICROHAL_MPU_BASE_ADDRESS 0xE000ED90
#define _MICROHAL_STK_BASE_ADDRESS 0xE000E010
#define _MICROHAL_SCB_BASE_ADDRESS 0xE000ED00
#define _MICROHAL_NVIC_STIR_BASE_ADDRESS 0xE000EF00
#define _MICROHAL_FPU_CPACR_BASE_ADDRESS 0xE000ED88
#define _MICROHAL_SCB_ACTRL_BASE_ADDRESS 0xE000E008

#endif // _MICROHAL_REGISTERS_BASE_ADDRESS_DEFINITIONS_STM32F410_H_
